In [2]:
import pandas as pd

In [3]:
# to create data frame --> use pd.DataFrame

data={'Name':['AAA','BBBB','CCCC','DDDD'],
       'Age':[10,20,30,40],
       'marks':[80.23,89.2,91.23,74.23]}

df=pd.DataFrame(data)
# print(df)
df

   Name  Age  marks
0   AAA   10  80.23
1  BBBB   20  89.20
2  CCCC   30  91.23
3  DDDD   40  74.23

In [4]:
#df.head()  #top 5 data
#df.head(3)  #top 3 data
df.tail(2)   #bottom 2

   Name  Age  marks
2  CCCC   30  91.23
3  DDDD   40  74.23

In [5]:
df.info()  #information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   marks   4 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 228.0+ bytes

In [6]:
df.describe()

             Age      marks
count   4.000000   4.000000
mean   25.000000  83.722500
std    12.909944   7.930336
min    10.000000  74.230000
25%    17.500000  78.730000
50%    25.000000  84.715000
75%    32.500000  89.707500
max    40.000000  91.230000

In [7]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [8]:
print(df.dtypes)

Name      object
Age        int64
marks    float64
dtype: object

In [9]:
print(df.index)

RangeIndex(start=0, stop=4, step=1)

In [10]:
print(df.values)

[['AAA' 10 80.23]
 ['BBBB' 20 89.2]
 ['CCCC' 30 91.23]
 ['DDDD' 40 74.23]]

In [11]:
print(df.columns)   #coulms index

Index(['Name', 'Age', 'marks'], dtype='object')

In [12]:
#access the values using indexing
print(df.iloc[0])   #1st row

Name       AAA
Age         10
marks    80.23
Name: 0, dtype: object

In [13]:
print(df["Name"])

0     AAA
1    BBBB
2    CCCC
3    DDDD
Name: Name, dtype: object

In [14]:
print(df["Age"])

0    10
1    20
2    30
3    40
Name: Age, dtype: int64

In [15]:
print(df["marks"])

0    80.23
1    89.20
2    91.23
3    74.23
Name: marks, dtype: float64

In [16]:
#Slicing
df.iloc[0:3]

   Name  Age  marks
0   AAA   10  80.23
1  BBBB   20  89.20
2  CCCC   30  91.23

In [17]:
df[["Name","Age"]]

   Name  Age
0   AAA   10
1  BBBB   20
2  CCCC   30
3  DDDD   40

In [18]:
df[["Name","Age"]].head(2)

   Name  Age
0   AAA   10
1  BBBB   20

In [19]:
df["Name"].iloc[0:3]

0     AAA
1    BBBB
2    CCCC
Name: Name, dtype: object

In [20]:
#1.From a Dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['Delhi', 'Mumbai', 'Bangalore']
}
df = pd.DataFrame(data)
print(df)

      Name  Age       City
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore

In [21]:
#2.From List of Lists
data = [['Alice', 25], 
        ['Bob', 30], 
        ['Charlie', 35]]

df = pd.DataFrame(data, columns=['Name', 'Age'])
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [22]:
#List of tuples
li=[('AAA',24,89.23),
   ('BBBB',24,89.23),
   ('CCCc',24,89.23),
   ('DDDD',24,89.23)]

df=pd.DataFrame(li,columns=['Name','Age','Marks'])
print(df)

   Name  Age  Marks
0   AAA   24  89.23
1  BBBB   24  89.23
2  CCCc   24  89.23
3  DDDD   24  89.23

In [23]:
#print(df[0])

In [24]:
print(df['Name'])

0     AAA
1    BBBB
2    CCCc
3    DDDD
Name: Name, dtype: object

In [25]:
#3.From List of Dictionaries
data = [
    {'Name': 'Alice', 'Age': 25},
    {'Name': 'Bob', 'Age': 30}
]
df = pd.DataFrame(data)
df

    Name  Age
0  Alice   25
1    Bob   30

In [26]:
#4. From Series
s1 = pd.Series([1, 2])
s2 = pd.Series([3, 4])
data={'A': s1, 'B': s2}
df = pd.DataFrame(data)
df

   A  B
0  1  3
1  2  4

In [27]:
data={'Name':['AAA','BBBB','CCCC','DDDD'],
       'Age':[10,20,30,40],
       'marks':[80.23,89.2,91.23,74.23]}

df=pd.DataFrame(data)
# print(df)
df

   Name  Age  marks
0   AAA   10  80.23
1  BBBB   20  89.20
2  CCCC   30  91.23
3  DDDD   40  74.23

In [29]:
#editing /modification 
#Add new column
df['city']=['Indore','Bhopal','Sagar','Dewas']
df

   Name  Age  marks    city
0   AAA   10  80.23  Indore
1  BBBB   20  89.20  Bhopal
2  CCCC   30  91.23   Sagar
3  DDDD   40  74.23   Dewas

In [31]:
df['Age']=df['Age']+2
df

   Name  Age  marks    city
0   AAA   14  80.23  Indore
1  BBBB   24  89.20  Bhopal
2  CCCC   34  91.23   Sagar
3  DDDD   44  74.23   Dewas

In [35]:
#df.drop()  --> it use to remove the column/row
#column  --> axis 1
df.drop('city',axis=1,inplace=True)

In [36]:
df

   Name  Age  marks
0   AAA   14  80.23
1  BBBB   24  89.20
2  CCCC   34  91.23
3  DDDD   44  74.23

In [ ]:
#remove row 2nd row
df.drop(1,axis=0,inplace=True)